Repository: fvs-ksa/tadweeralkheer1-master
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Call
ar: مكالمه هاتفيه

source: phone
ar: الجوال

source: Message
ar: رساله نصيه

source: Gmail
ar: البريد الاكتروني

source: Whatsapp
ar: واتساب

# appname
source: Tadweer Alkhir
ar: تدوير الخير

source: Home
ar: الرئيسية

source: Profile
ar: حسابي

source: Donations
ar: الطلبات

source: Settings
ar: الاعدادات

source: My Donations
ar: طلباتي

source: Costomer Review
ar: اراء العملاء

source: Privacy
ar: سياسة الخصوصية

# aboutus
source: About Tadween Alkheer
ar: عن تدوير الخير

# help
source: Help those who are in need
ar: قدم طلبك الان عبر تطبيق تدوير الخير

source: Add
ar: تسليم الآن

source: Posted Date:
ar: تاريخ الاضافة:

source: Pickup Address:
ar: عنوان الاستلام

source: Item Description:
ar: الوصف

# itemname
source: Name:
ar: اسم العنصر:

# itemcategory
source: Category
ar: القسم

# quantity
source: Quanity:
ar: العدد:

source: Pickup Date & Time:
ar: تاريخ و وقت الاستلام:

# staus
source: Status:
ar: الحالة

source: Join Date:
ar: تاريخ الاضافة:

source: Address:
ar: العنوان:

source: Items Donated:
ar: عدد الطلبات:

source: Phone Number:
ar: رقم الجوال:

source: Email:
ar: البريدالالكتروني:

source: Logout
ar: تسجيل الخروج

source: Name:
ar: الاسم:

# namelabel
source: Name
ar: اسم العنصر

# descriptionlabel
source: Description
ar: الوصف

# quantitylabel
source: Quantity
ar: العدد

# pickupaddresslabel
source: Pickup Address
ar: عنوان الاستلام

# pickupdatetimelabel
source: Pickup Date & Time
ar: تاريخ و وقت الاستلام

source: Select Date & Time
ar: اختار التاريخ و الوقت

source: Donate Item
ar: رفع الطلب

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# fromcameraorgallery
source: Get image from Camera or Gallery?
ar: هل تريد اختيار الصورة من الكاميرا ام من المعرض؟

source: Add Picture
ar: اضف صورة

source: Add Video
ar: اضف مقطع فيديو

source: Support Center
ar: اتصل بنا

source: Save
ar: حفظ

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Image
ar: تعديل الصورة

# supportcentercontent
source: Contact us through our support Channels:
ar: تواصل معنا من خلال جهات التواصل الاتية:

# phonenumberlabel
source: Phone Number:
ar: رقم الجوال:

# emaillabel
source: Email
ar: البريدالالكتروني

# addresslabel
source: Address:
ar: العنوان

source: IC Number:
ar: رقم الهوية

source: Login
ar: تسجيل الدخول

source: Register
ar: تسجيل جديد

# haveaccount
source: I already have an account.
ar: عندي حساب. اذهب الى سجيل الدخول

source: New Account
ar: حساب جديد

# validemail
source: Please enter a valid email address
ar: ادخل بريد الكتروني صحيح

# validicnumber
source: Please enter ateast 4 characters
ar: ادخل 4 رموز على الاقل

# validaddress
source: Please enter ateast 10 characters
ar: ادخل 10 رموز على الاقل

# userexists
source: A user with this number already exists.
ar: يوجد حساب بهذا الرقم

source: Add Item
ar: طلب جديد

source: Current Tasks
ar: مهمات حالية

source: Completed Tasks
ar: مهمات مكتملة

source: Cancelled Tasks
ar: مهمات ملغى

source: All Tasks
ar: كل المهمات

source: My Tasks
ar: مهامي

source: Tasks
ar: مهمات

source: Picked up
ar: اكتمل الاستلام

source: Delivered
ar: تم التوصيل

# mapLocation
source: Map
ar: مواقعنا

source: Pickup Date:
ar: تاريخ الاستلام

source: Pickup Time:
ar: وقت الاستلام

source: Click on
ar: اضغط على

# tonavigate
source: to navigate to Google Maps for directions.
ar: للانتقال إلى خرائط Google للحصول على الاتجاهات.

source: Check Location
ar: عرض الموقع

# deliveredcontent
source: Delivered! Waiting for confirmation of complition.
ar: تم التوصيل! في انتظار تأكيد الاكتمال.

# loginrequiredalert
source: Login Required
ar: يتطلب تسجيل الدخول

# loginrequiredalertcontent
source: Please login or register to access features of Tadweer Al Kahir app.
ar: يرجى تسجيل الدخول أو التسجيل للوصول إلى ميزات تطبيق تدوير الخير.

source: Login as
ar: سجل دخول ك

source: Login as Donor
ar: سجل دخول كعميل

source: Donor
ar: عميل

source: Login as Driver
ar: سجل دخول كمندوب

source: Driver
ar: مندوب

# verifyphonenum
source: Please enter 10 digits
ar: الرجاء إدخال 10 أرقام

# verifyphonenum2
source: Phone number must start with 0
ar: يجب أن يبدأ رقم الهاتف بـ 0

# accountnotexist
source: Account does not exist. Create one instead.
ar: الحساب غير موجود. أنشئ حسابًا بدلاً من ذلك.

# languageword
source: Language
ar: اللغة

# least2CharError
source: This should be at least 2 characters.
ar: قم بادخال حرفين على الأقل.

# most15CharError
source: This should be at most 15 characters.
ar: يجب ألا يزيد عدد الأحرف عن 15 حرفًا.

# least10CharError
source: This should be at least 10 characters.
ar: يجب ادخال 10 احرف على الاقل

# most110CharError
source: This should be at most 110 characters.
ar: يجب ألا يزيد عدد الأحرف عن 110 حرف.

# descError
source: Please provide a description
ar: قم بأدخال وصف للعينة.

# quantityError
source: Please provide a quantity
ar: قم بتحديد كمية العينة

# least1QuantityError
source: This should be at least 1
ar: يجب الا تقل الكمية عن 1

source: Current Location
ar: موقعي الحالي

source: Select on Map
ar: اختر من الخريطة

source: No location chosen
ar: لم يتم تحديد الموقع

source: cancel
ar: الغاء

# donateDone
source: Your request has been successfully submitted, we thank you and inform you that the representative will contact you within 48 hours of receiving your request, thank you.
ar: تم رفع طلبكم بنجاح، نشكركم ونعلمكم ان المندوب سيتواصل معكم في خلال 48 ساعه من استلام المندوب لطلبكم، وشكرا

source: Return To Home
ar: الرجوع الى الصفحة الرئيسية

source: Pickup Date
ar: تاريخ الاستلام

source: Pickup Time
ar: وقت الاستلام

source: order
ar: طلبية

# loginRequired
source: This page requires your login credentials
ar: هذه الصفحة تحتاج الى تسجيل الدخول لعرضها

# partners
source: Our Partners
ar: شركاؤنا

# markedPoint
source: Donation Points
ar: مواقع التسليم

source: Image Gallery
ar: معرض الصور

source: Video Gallery
ar: معرض الفيديو

# mobileNumber
source: Phone Number:
ar: رقم الجوال

# validateMobile
source: Mobile Number must be of 10 digit
ar: يجب أن يتكون رقم الهاتف من 10 أرقام

# videoGalleryEmpty
source: no videos in gallery, comeback later
ar: لاتوجد فيديوهات حالياً, حاول في وقت لاحق

source: More
ar: المزيد

# ready
source: Request uploaded
ar: تم رفع الطلب

# preparing
source: Coordinated driver
ar: تم التنسيق مع السائق

# received
source: The receipt request
ar: تم استلام الطلب

# rateText
source: What do you think about the request..
ar: رأيكم يهمنا

# mydonationPoint
source: My Points
ar: نقاطي

source: Title Logo
ar: معاً لبيئة مستدامة واجر دائم.

# sendComment
source: Send
ar: ارسال

# ourWebsite
source: Visit Our Website
ar: موقعنا الالكتروني

source: Contribution Points
ar: نقاط المساهمات

# definePoints
source: Contributions Points It is a motivational program to reward the donor so that each donor gets 100 points for each donation request, and another 50 points for evaluation and notes on the request.
ar: نقاط المساهمات هو برنامج تحفيزي على مكافئة المتبرع بحيث كل متبرع يحصل على 100 نقطة على كل طلب تبرع, و 50 نقطة اخرى على تقييم وملاحظات على الطلب.

# settingsTabBar
source: Settings
ar: الاعدادات

# aboutTadweer
source: In the light of contemporary life, the wasted and damaged goods (paper - furniture - plastic - used clothes .. etc.) multiplied and these materials are buried or burned to get rid of them!! From here came this application to organize and facilitate the sustainable use of these materials in the best ways that benefit the individual with a wage, the environment with public health, and the charities with abundant benefit. While adhering to the best standards in getting the work done perfectly.
ar: في ظل الحياة المعاصرة تكاثرت الخيرات المهدرة التالفة ( الورق - الأثاث - البلاستيك - الملابس المستعملة .. الخ ) ويتم دفن هذه المواد أو حرقها للتخلص منها !! . من هنا جاء هذا التطبيق لتنظيم وتسهيل استدامة الاستفادة من هذه المواد بأفضل الطرق التي تعودعلى الفرد بالأجر ، وعلى البيئة بالصحة العامة ، وعلى الجمعيات الخيرية بالنفع الوفير.مع الالتزام بأفضل المعايير في إنجاز العمل بإتقان.

source: vision :
ar: الرؤية:

# visiondetails
source: Sustainable environment, sustainable welfare.
ar: بيئة مستدامة، وأجر دائم.

# messageTadweer
source: message :
ar: الرسالة :

# messageDetails
source: The project provides economic and environmental solutions to benefit from wasted wealth that serves our dear country, by finding sound ways to dispose of environmental remnants away from the damages of burying them underground or burning them. The Recycling Al Khair project also receives Sharia books and the Noble Qurâ€™an to be distributed to needy students of knowledge; In order to protect it from insult, it contains the name of God.
ar: يوفر المشروع حلولا اقتصادية وبيئية للاستفادة من ثروات مهدرة تخدم وطننا الغالي، من خلال إيجاد طرق سليمة للتخلص من مخلفات البيئة بعيدا عن أضرار دفنها في باطن الأرض أو حرقها. كما يستقبل مشروع تدوير الخير الكتب الشرعية والمصاحف الشريفة ليتم توزيعها على طلبة العلم المحتاجين؛ حفاظا عليها من الإهانة وفيها اسم الله.

# ratingDone
source: Rating Done Successfully
ar: تم اضافة التقيم بنجاح
